{"images":[{"startdate":"20221127","fullstartdate":"202211270800","enddate":"20221128","url":"/th?id=OHR.Cecropia_EN-US9602789937_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.Cecropia_EN-US9602789937","copyright":"Cecropia leaf atop lobster claw petals, Mexico (© Gerry Ellis/Minden Pictures)","copyrightlink":"/search?q=Cecropia&form=hpcapt&filters=HpDate%3a%2220221127_0800%22","title":"Unbe-leaf-able","caption":"Cecropia leaf and lobster claw petals in Mexico","copyrightonly":"© Gerry Ellis/Minden Pictures","desc":"No doubt your eyes are drawn to the large, silver-bluish leaf in today's photo, but there's a little more to this colorful display. We're on the floor of a Mexican rainforest to examine a large Cecropia leaf and some lobster claw petals. The genus called Cecropia contains some of the most recognizable neotropical trees anywhere, but the roughly 60 different species can be hard to tell apart. All Cecropias grow fast, by tree standards anyway. On average, they'll climb about 2.5 feet per year and under perfect conditions can grow as much as 10 feet in that time, eventually reaching around 60 feet tall. When dried, Cecropia leaves shrivel into a fist-like form which displays interesting patterns and shapes. Not only are Cecropias very popular with animals like sloths, monkeys, and toucans for their fruit and leaves, many species have a symbiotic relationship with Azteca ants. Cecropias provide shelter and food for ants, and the ants in turn defend the trees from plant-eating predators.","date":"Nov 27, 2022","bsTitle":"Unbe-leaf-able","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20221127_Cecropia%22&FORM=HPQUIZ","wp":true,"hsh":"a25bcc2d16aed24788257fd286b2d732","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}