{"images":[{"startdate":"20220724","fullstartdate":"202207240700","enddate":"20220725","url":"/th?id=OHR.AmeliaEarhart_EN-US4396076505_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.AmeliaEarhart_EN-US4396076505","copyright":"Amelia Earhart teaching students in Newark, New Jersey (© Bettmann/Getty Images)","copyrightlink":"/search?q=Amelia+Earhart&form=hpcapt&filters=HpDate%3a%2220220724_0700%22","title":"Her legend and mystery endure","caption":"Amelia Earhart","copyrightonly":"© Bettmann/Getty Images","desc":"Few people in modern history have captured our imagination as much as the famed aviator Amelia Earhart, born on this day in 1897. She was doubly a pioneer of her day, a skilled pilot when flying was a relatively new and daring endeavor, and a woman in a field dominated by men. Earhart's legend was made, sadly, not as much by her piloting accomplishments as by her sudden disappearance in 1937 when her fame was still ascending. The 39-year-old famously went missing, along with navigator Fred Noonan, in the middle of the Pacific Ocean, near Howland Island, while attempting to fly around the world. The official search for Earhart and Noonan lasted 17 days. The US Navy and Coast Guard searched 150,000 square miles of the Pacific, an effort that became the most expensive search in history at the time. Her husband, George Putnam, led a private search in the months that followed. No verified trace of Earhart, Noonan, or the twin-propeller Lockheed Electra plane has ever been found.","date":"Jul 24, 2022","bsTitle":"Her legend and mystery endure","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20220724_AmeliaEarhart%22&FORM=HPQUIZ","wp":false,"hsh":"53d4f47de31f5c79e8256f3e58e7a232","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}