{"images":[{"startdate":"20221102","fullstartdate":"202211020700","enddate":"20221103","url":"/th?id=OHR.SpruceGoose_EN-US0021752220_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.SpruceGoose_EN-US0021752220","copyright":"The Hughes H-4 Hercules, aka the Spruce Goose, November 1947, Long Beach Harbor, California (© J R Eyerman/Shutterstock)","copyrightlink":"/search?q=Spruce+Goose&form=hpcapt&filters=HpDate%3a%2220221102_0700%22","title":"'If it's a failure, I'll probably leave this country'","caption":"75th anniversary of the 'Spruce Goose'","copyrightonly":"© J R Eyerman/Shutterstock","desc":"Today we're looking back to a time when an eccentric billionaire's dream of reaching new heights was still a novel idea. It was 75 years ago today that Howard Hughes' 'flying boat,' dubbed the 'Spruce Goose,' made its one and only flight. Officially named the Hughes H-4 Hercules, the press persisted in calling it the 'Spruce Goose' even though it was constructed almost entirely of birch wood. The plane was commissioned in 1942 by American industrialist Henry Kaiser, who supplied ships to the US during World War II. Kaiser recruited Hughes—the film producer turned pilot, engineer, and business magnate—to build a flying cargo ship that could avoid German submarines while transporting troops and war supplies across the Atlantic. The contract called for three of the planes to be built within two years. Hughes was still working on the design when the war ended—in the end, he delivered only the one in our photo, two years after V-E Day.","date":"Nov 2, 2022","bsTitle":"'If it's a failure, I'll probably leave this country'","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20221102_SpruceGoose%22&FORM=HPQUIZ","wp":false,"hsh":"0e248a3f22d74bb88cb7d5a30415a166","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}