{"images":[{"startdate":"20230103","fullstartdate":"202301030800","enddate":"20230104","url":"/th?id=OHR.SandhillSleeping_EN-US4023790571_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.SandhillSleeping_EN-US4023790571","copyright":"Sandhill cranes, Bosque del Apache National Wildlife Refuge, New Mexico (© Jay Goodrich/Tandem Stills + Motion)","copyrightlink":"/search?q=Sandhill+cranes+Bosque+del+Apache+National+Wildlife+Refuge+New+Mexico&form=hpcapt&filters=HpDate%3a%2220230103_0800%22","title":"Who's snoozing?","caption":"Sandhill cranes, Bosque del Apache National Wildlife Refuge","copyrightonly":"© Jay Goodrich/Tandem Stills + Motion","desc":"Hey, don't judge. Migrating takes it out of you! Yes, these sandhill cranes are sleeping on their feet in the waters of the Bosque del Apache National Wildlife Refuge in southern New Mexico. The birds start arriving around Halloween each year, and as many as 10,000 of them will stay to rest and feed in local fields until February. What's on the menu? Well, sandhill cranes aren't picky; they'll eat whatever's available, from plants and grains, to insects, snails, and even snakes. And they have plenty of avian company at this beautiful refuge each winter—whooping cranes, ducks, and snow geese from as far away as Alaska and Siberia also count Bosque del Apache as a favorite resting spot before heading north to their breeding grounds when the days get warmer. Thankfully, there's plenty of room to spread their wings at the 57,000-acre refuge.","date":"Jan 3, 2023","bsTitle":"Who's snoozing?","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20230103_SandhillSleeping%22&FORM=HPQUIZ","wp":true,"hsh":"fd0f92c697ae8ea5d7f7f139079fe830","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}