{"images":[{"startdate":"20240322","fullstartdate":"202403220700","enddate":"20240323","url":"/th?id=OHR.WaikatoWater_EN-US1360247236_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.WaikatoWater_EN-US1360247236","copyright":"Blue Spring, Te Waihou Walkway, New Zealand (© Ian Beattie/Alamy)","copyrightlink":"/search?q=World+Water+Day&form=hpcapt&filters=HpDate%3a%2220240322_0700%22","title":"'Water' we celebrating?","caption":"World Water Day","copyrightonly":"© Ian Beattie/Alamy","desc":"It's World Water Day, a United Nations event that ripples across the globe, reminding us of the importance of this essential resource. Water quenches thirst and irrigates harvests, and its absence can derail prosperity and stability. The World Economic Forum lists the water crisis among the top global risks, with 2.2 billion people still lacking access to clean water. From educational forums to local cleanups, each action, big or small, contributes to the wave of change needed to address the crisis. This year's theme, 'Water for Peace,' invites us to reflect on water's power to foster unity. So, are you ready to dive into a current that flows deeper than New Zealand's Blue Spring at Te Waihou Walkway, pictured on our homepage? This clear spring is renowned for its purity, supplying about 70% of the country's bottled water. For those in regions without easy access to safe water, World Water Day is here to promote greater cooperation to help conserve this crucial resource, for everyone.","date":"Mar 22, 2024","bsTitle":"'Water' we celebrating?","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240322_WaikatoWater%22&FORM=HPQUIZ","wp":true,"hsh":"59622230a2f0d35e7574e711eb518d50","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}