{"images":[{"startdate":"20240407","fullstartdate":"202404070700","enddate":"20240408","url":"/th?id=OHR.BeaverDenali_EN-US1894047698_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.BeaverDenali_EN-US1894047698","copyright":"North American beaver in a pond near Wonder Lake, Denali National Park, Alaska (© Paul Souders/Getty Images)","copyrightlink":"/search?q=International+Beaver+Day&form=hpcapt&filters=HpDate%3a%2220240407_0700%22","title":"Look, I'm a branch manager!","caption":"International Beaver Day","copyrightonly":"© Paul Souders/Getty Images","desc":"Known as nature's engineers, beavers have been shaping the world for millions of years. Historically, North American beavers faced challenges from humans. They were hunted for their fur, and their 'nuisance' freshwater abodes were destroyed. However, these buck-toothed, paddle-tailed dam builders have been gaining new respect in recent years. These animals have beneficial effects not only on water quality but also on land. With their iron-coated orange incisors, beavers fell trees, diligently constructing not just homes but habitats. Their dams create life-sustaining wetlands for countless species. Meanwhile, their lodges are masterpieces of security and comfort, the entrance strategically submerged to deter predators and provide privacy. The rodents have no trouble getting in, as they can hold their breath for up to 15 minutes. So, 'woodn't' it be nice to give a shout-out to these creatures on International Beaver Day?","date":"Apr 7, 2024","bsTitle":"Look, I'm a branch manager!","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240407_BeaverDenali%22&FORM=HPQUIZ","wp":true,"hsh":"529c70404aab6559c6b9c7c1e7a3e624","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}