{"images":[{"startdate":"20240906","fullstartdate":"202409060700","enddate":"20240907","url":"/th?id=OHR.GlenariffPark_EN-US3914128007_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.GlenariffPark_EN-US3914128007","copyright":"Ancient beech tree, Glenariff Forest Park, County Antrim, Northern Ireland (© Dawid K Photography/Shutterstock)","copyrightlink":"/search?q=Glenariff+Forest+Park+County+Antrim+Northern+Ireland&form=hpcapt&filters=HpDate%3a%2220240906_0700%22","title":"'Wood' you believe this view?","caption":"Glenariff Forest Park, Northern Ireland, UK","copyrightonly":"© Dawid K Photography/Shutterstock","desc":"Ever wondered what it's like to stroll through a storybook? Welcome to Glenariff Forest Park in County Antrim, Northern Ireland. This park spans nearly 3,000 acres of woodland, waterfalls, and wonder, and it boasts several walking trails, each offering its own unique perspective of the landscape. The most popular is the Waterfall Walkway, a 3-mile trail that passes through a National Nature Reserve and features the Ess-na-Crub and Ess-na-Larach waterfalls. Glenariff is home to a rich diversity of wildlife including red squirrels, pine martens, and badgers. Birdwatchers will be delighted by willow warblers, chiffchaffs, and kingfishers. The flora is just as impressive, with trees such as the ancient beech, pictured here, oak, birch, and rowan creating a lush canopy. So, whenever you choose to visit, Glenariff is sure to leave you feeling 're-leafed' and rejuvenated.","date":"Sep 6, 2024","bsTitle":"'Wood' you believe this view?","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240906_GlenariffPark%22&FORM=HPQUIZ","wp":true,"hsh":"e5b6ad1c181766bc7e9ed7958a33c68f","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}