{"images":[{"startdate":"20240530","fullstartdate":"202405300700","enddate":"20240531","url":"/th?id=OHR.Everglades90th_EN-US5663293086_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.Everglades90th_EN-US5663293086","copyright":"A stand of slash pines and sawgrass prairie, Everglades National Park, Florida (© Jonathan Gewirtz/Tandem Stills + Motion)","copyrightlink":"/search?q=everglades+national+park&form=hpcapt&filters=HpDate%3a%2220240530_0700%22","title":"'Everglad' to be here","caption":"Everglades National Park marks 90 years","copyrightonly":"© Jonathan Gewirtz/Tandem Stills + Motion","desc":"On this day 90 years ago, Congress passed an act that would lead to the creation of one of America's natural gems: Everglades National Park in Florida. It would be another 13 years before enough land was acquired to make the park a reality but today, it encapsulates the largest subtropical wilderness in the US. Spanning more than 1.5 million acres, the park is a lifeline to 36 federally protected and endangered wildlife species, from the gentle manatee to the stealthy Florida panther. Here, the air thrums with the calls of over 350 bird species like limpkins and snail kites, while the waters teem with life including hundreds of species of fish, sea turtles, and American crocodiles. Beyond its biodiversity, the park is celebrated as a UNESCO World Heritage Site, an International Biosphere Reserve, and a Wetland of International Importance. Here's to Everglades National Park—may it continue to inspire wonder, curiosity, and appreciation for the wild world around us.","date":"May 30, 2024","bsTitle":"'Everglad' to be here","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240530_Everglades90th%22&FORM=HPQUIZ","wp":true,"hsh":"2e4a828f9f86f17f4e2bc563f37e954f","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}