{"images":[{"startdate":"20240522","fullstartdate":"202405220700","enddate":"20240523","url":"/th?id=OHR.SnowGumTasmania_EN-US4058572259_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.SnowGumTasmania_EN-US4058572259","copyright":"Tasmanian snow gum trees, Mount Field National Park, Tasmania, Australia (© Ignacio Palacios/Getty Images)","copyrightlink":"/search?q=International+Day+for+Biological+Diversity&form=hpcapt&filters=HpDate%3a%2220240522_0700%22","title":"A beacon of biodiversity","caption":"International Day for Biological Diversity","copyrightonly":"© Ignacio Palacios/Getty Images","desc":"Today we're celebrating the biodiversity of our planet. What exactly is biodiversity? It refers to the variety of living things, from animals and plants to fungi and microorganisms, in one area. This delicate but vigorous balance in nature is what keeps us all alive. That's definitely worth celebrating! May 22 was named International Day for Biological Diversity by the United Nations in 2000. Unfortunately, the biodiversity of Earth is slowly decreasing due to climate change, the draining of natural resources, urbanization, and pollution, among other factors. Campaigners are urging governments, businesses and individuals to take action to boost biodiversity, to protect healthy ecosystems that supply us with water, food, medicines, and more. After all, we are blessed with intriguing species such as the Tasmanian snow gum—the tree seen in today's image—that takes root in one of the most biologically diverse places on the planet, the Mount Field National Park in Tasmania, Australia.","date":"May 22, 2024","bsTitle":"A beacon of biodiversity","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240522_SnowGumTasmania%22&FORM=HPQUIZ","wp":true,"hsh":"1e2572ab471a3df2e11dc31fd5f9456d","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}