{"images":[{"startdate":"20240731","fullstartdate":"202407310700","enddate":"20240801","url":"/th?id=OHR.HoodoosBryce_EN-US6434628044_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.HoodoosBryce_EN-US6434628044","copyright":"Hoodoos, Sunset Point, Bryce Canyon National Park, Utah (© Tim Fitzharris/Minden Pictures)","copyrightlink":"/search?q=Bryce+Canyon+National+Park+Utah&form=hpcapt&filters=HpDate%3a%2220240731_0700%22","title":"'Hoodoo' we have here?","caption":"Hoodoos, Sunset Point, Bryce Canyon National Park, Utah","copyrightonly":"© Tim Fitzharris/Minden Pictures","desc":"Let's take a trip to a forest of stones. Sunset Point, seen in today's image, offers sweeping views of the hoodoos of Utah's Bryce Canyon National Park. These rock formations are created by frost weathering and stream erosion, which shape the stone into an otherworldly landscape. Perched at 8,000 to 9,000 feet, this overlook offers a panoramic view of rocky spires in red, orange, and white. The most iconic of them is Thor's Hammer, a hoodoo that overlooks a part of the park known as the 'Silent City.' The Queen's Garden Trail, which leads from Sunset Point to Sunrise Point, offers even more vistas and rock formations, including the Queen Victoria hoodoo. According to the legend told by the Paiute Indigenous people who inhabited this area, hoodoos are people who have been turned to stone for their misdeeds by the trickster Coyote. Whether you're a hiker, a photographer, or simply a traveler, the hoodoos are waiting.","date":"Jul 31, 2024","bsTitle":"'Hoodoo' we have here?","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20240731_HoodoosBryce%22&FORM=HPQUIZ","wp":true,"hsh":"da724d21c8a17c8ab790a8d6d34b8dba","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}