{"images":[{"startdate":"20250818","fullstartdate":"202508180700","enddate":"20250819","url":"/th?id=OHR.AvalancheLake_EN-US1814683119_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.AvalancheLake_EN-US1814683119","copyright":"Avalanche Lake Trail at Adirondack High Peaks, New York (© Posnov/Getty Images)","copyrightlink":"/search?q=Avalanche+Lake+New+York&form=hpcapt&filters=HpDate%3a%2220250818_0700%22","title":"Stream a little dream","caption":"Avalanche Lake Trail at Adirondack High Peaks, New York","copyrightonly":"© Posnov/Getty Images","desc":"There's no easing into the wild here—the Avalanche Lake Trail carves a bold path through rock scrambles, narrow ledges, and alpine serenity. Tucked away in New York's Adirondack High Peaks, this 9-acre alpine lake sits at nearly 2,900 feet between Mount Colden and Avalanche Mountain. Shaped by ancient glaciers, the lake is framed by dramatic cliffs and rugged terrain that echo its icy origins. Its most striking feature is the Trap Dike—a towering 1,200-foot rock canyon flanked by steep walls, making the lake one of the most awe-inspiring sights in the Adirondacks. Massive avalanches carved these cliffs, leaving behind the dramatic landscape that gave Avalanche Lake its name. The Avalanche Lake Trail begins at the Adirondack Loj, a well-known launch point for adventures in the High Peaks. Spanning about 9.6 miles round trip with a 1,350-foot elevation gain, the hike may seem manageable on paper—but it's the uneven terrain that truly tests your mettle.","date":"Aug 18, 2025","bsTitle":"Stream a little dream","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20250818_AvalancheLake%22&FORM=HPQUIZ","wp":true,"hsh":"c2e970503cb99bba4c28cfbe0ade65e2","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}