{"images":[{"startdate":"20250813","fullstartdate":"202508130700","enddate":"20250814","url":"/th?id=OHR.CoronaArch_EN-US8928406175_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.CoronaArch_EN-US8928406175","copyright":"A man rappels off Corona Arch near Moab, Utah (© Grant Ordelheide/TANDEM Stills + Motion)","copyrightlink":"/search?q=Natural+arch&form=hpcapt&filters=HpDate%3a%2220250813_0700%22","title":"Earth's open secret","caption":"Corona Arch near Moab, Utah","copyrightonly":"© Grant Ordelheide/TANDEM Stills + Motion","desc":"Just outside Arches National Park in Utah lies a natural wonder that rises like a colossal doorway against the sky, drawing photographers, nature lovers, and hikers. Welcome to Corona Arch, seen in today's image, a towering Navajo sandstone formation that offers big adventure without the big crowds. The Corona Arch Trail starts off easy but packs a punch of scenery: railroad tracks, slickrock scrambles, and even a metal cable assist make it more than just a walk in the desert. After 1.5 miles of walking, the payoff is big: a massive arch that's 140 feet wide and 105 feet high. It's so large that people once swung from it on ropes, until that was banned for safety reasons. Even without the adrenaline stunts, the hike offers beautiful views and unforgettable moments in the heart of Red Rock Country. Also known as Little Rainbow Bridge, it shares visual similarities with the iconic Rainbow Bridge arch near Lake Powell—but Corona Arch holds its own in a more peaceful setting.","date":"Aug 13, 2025","bsTitle":"Earth's open secret","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20250813_CoronaArch%22&FORM=HPQUIZ","wp":true,"hsh":"065f7491376397b2b405e5c724f03a1e","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}