{"images":[{"startdate":"20250625","fullstartdate":"202506250700","enddate":"20250626","url":"/th?id=OHR.GlastonburyScenic_EN-US2433998806_UHD.jpg&rf=LaDigue_UHD.jpg&pid=hp&w=3840&h=2160&rs=1&c=4","urlbase":"/th?id=OHR.GlastonburyScenic_EN-US2433998806","copyright":"St. Michael's Church Tower on Glastonbury Tor, Glastonbury, Somerset, England (© Gavin Hellier/Getty Images)","copyrightlink":"/search?q=Glastonbury+Festival&form=hpcapt&filters=HpDate%3a%2220250625_0700%22","title":"Tor and tunes: Glastonbury begins","caption":"Glastonbury Festival begins","copyrightonly":"© Gavin Hellier/Getty Images","desc":"As the sun rises over the hills in Somerset, Glastonbury Festival comes alive, transforming a quiet part of South West England into one of the world's most famous music destinations. Since its humble beginnings in 1970, when tickets cost just one British pound, Glastonbury has grown into a cultural powerhouse, attracting over 200,000 fans each year. The festival is deeply rooted in the ideals of the hippie movement, the 1960s counterculture, and the free festival spirit that sparked its early days. From David Bowie and Elton John to Metallica and Billie Eilish, Glastonbury's stages have hosted performances that have defined generations. This year's festival runs from today through June 29, with The 1975, Neil Young, and Olivia Rodrigo topping the bill. Overlooking the event is Glastonbury Tor, pictured here, a hill crowned by the 14th-century St. Michael's Church Tower. The Tor is steeped in myth and legend, from ties to King Arthur's Avalon to ancient spiritual lore.","date":"Jun 25, 2025","bsTitle":"Tor and tunes: Glastonbury begins","quiz":"/search?q=Bing+homepage+quiz&filters=WQOskey:%22HPQuiz_20250625_GlastonburyScenic%22&FORM=HPQUIZ","wp":true,"hsh":"155b6b2f48ad58438aa2e7b800d03025","drk":1,"top":1,"bot":1,"hs":[]}],"tooltips":{"loading":"Loading...","previous":"Previous image","next":"Next image","walle":"This image is not available to download as wallpaper.","walls":"Download this image. Use of this image is restricted to wallpaper only."}}